number = int(input("Введите любое пятизначное число:\n"))
function = ((((number // 10) % 10) ** (number % 10)) * ((number // 100) % 10)) // (((number // 10000) % 10) - ((number // 1000) % 10))
print(float(function))
# Сначала в выражении (number // 10) % 10 берется цифра среднего разряда числа, с помощью операции целочисленного деления на 10 (number // 10),
# а затем находится остаток от деления на 10 (number // 10) % 10, чтобы получить цифру единицы.
# Аналогично в выражении (number // 100) % 10 находим цифру разряда сотен.
# Выражение (number // 10000) % 10 находит цифру разряда десятков тысяч.
# Выражение (number // 1000) % 10 находит цифру разряда тысяч.
# Затем происходит выполнение математических операций:
# Цифра единицы возведена в степень цифры десятков ** (number % 10).
# Результат умножается на цифру сотен * ((number // 100) % 10).
# Результат целочисленного деления этой суммы на разницу цифр десятков тысяч и тысяч // (((number // 10000) % 10) - ((number // 1000) % 10)).
#
# Попросил нейросеть прокомментировать мой код :)
